
# Заполняет многоугольник заряженными частицами.
# У каждой частицы есть заряд. Задача состоит в том, чтобы
# Покрыть весь многоугольник магнитными полями зарядов.
# Частицы не могут выйти за границу многоугольника.

# За счёт чего они не выходят за границу?
# Вариант "намагнитить что-то работает не очень"
# 1. Только если намагнитить весь многоугольник в целом
# Как это сделать и какие side-эффекты (можно попробовать, от меня не убудет)
# 2. Просто сделать стенки жёсткими границами, будто
# заряды находятся в закрытом коробе. Заспавним в случайных точках
# (например в тех самых точках-приближениях многоугольника)

# Как это делать?
# Ответ эксперта Широкова Ярослава Васильевича:
# "Жопой об косяк"
